app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("created_at", "name", "slug", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 16 Jun 2015 02:06:04 EDT -04:00], ["name", "Week 1"], ["slug", "week-1"], ["updated_at", Tue, 16 Jun 2015 02:06:04 EDT -04:00]]

  def show
    @category = Category.find_by slug: params[:id]
---
SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'week-1' LIMIT 1