app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'css-position-absolute' LIMIT 1
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "It was a very well explained article."], ["created_at", Tue, 16 Jun 2015 02:17:32 EDT -04:00], ["post_id", 1], ["updated_at", Tue, 16 Jun 2015 02:17:32 EDT -04:00], ["user_id", 2]]
---
  def create
    @post = Post.find_by slug: params[:post_id]
    @comment = @post.comments.build(params.require(:comment).permit(:body))
    @comment.user = current_user

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 16 Jun 2015 02:18:27 EDT -04:00], ["updated_at", Tue, 16 Jun 2015 02:18:27 EDT -04:00], ["user_id", 2], ["vote", true], ["voteable_id", 1], ["voteable_type", "Comment"]]
---
  def vote
    @comment = Comment.find(params[:id])
    @vote = Vote.create(voteable: @comment, user: current_user, vote: params[:vote])