app/controllers/posts_controller.rb

  def index
    @post = Post.all.sort_by{|x| x.total_votes}.reverse
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    if @post.save
---
INSERT INTO "posts" ("created_at", "description", "slug", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def vote
    @vote = Vote.create(voteable: @post, user: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 16 Jun 2015 02:18:34 EDT -04:00], ["updated_at", Tue, 16 Jun 2015 02:18:34 EDT -04:00], ["user_id", 2], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]

  def set_post
    @post = Post.find_by slug: params[:id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'css-position-absolute' LIMIT 1