app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "slug", "time_zone", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

  def set_user
    @user = User.find_by slug: params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."slug" = 'rickcid' LIMIT 1